In [1]:
%pip install -U 'sqlalchemy<2.0'
%pip install pymysql

Note: you may need to restart the kernel to use updated packages.

ЌҐ г¤ Ґвбп ­ ©вЁ гЄ § ­­л© д ©«.

Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
     -------------------------------------- 45.0/45.0 kB 739.0 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1
Note: you may need to restart the kernel to use updated packages.

In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [2]:
db_connection_str = 'mysql+pymysql://student:VisionDrivesDecision@dsintrodb.skillbox.ru/classicmodels'
db_engine = create_engine(db_connection_str)

In [5]:
# Запрос, который выберает из таблицы orderdetails топ-10 строк с максимальной общей стоимостью конкретного товара в рамках заказа. 
# Для каждой строки выводит номер заказа, артикул товара и общую стоимость товара в заказе. 

sql_query1 = ('''
SELECT orderNumber, productCode, quantityOrdered * priceEach AS totalCost
FROM orderdetails
ORDER BY totalCost DESC
LIMIT 10;
''')

df1 = pd.read_sql_query(sql_query, con=db_engine)
df1

   orderNumber productCode  totalCost
0        10403    S10_4698   11503.14
1        10405    S12_4675   11170.52
2        10407    S18_1749   10723.60
3        10404    S12_1099   10460.16
4        10312    S10_1949   10286.40
5        10424    S10_1949   10072.00
6        10348    S12_1108    9974.40
7        10405    S24_3856    9712.04
8        10196    S12_1108    9571.08
9        10206    S10_1949    9568.73

In [10]:
# Запрос, который возвращает только те заказы, итоговая стоимость которых превышает 59 000 долларов. 

sql_query2 = ('''
SELECT orderNumber, SUM(quantityOrdered * priceEach) AS total
FROM orderdetails
GROUP BY orderNumber
HAVING total > 59000
ORDER BY orderNumber DESC;
''')

df2 = pd.read_sql_query(sql_query2, con=db_engine)
df2

   orderNumber     total
0        10310  61234.67
1        10287  61402.00
2        10212  59830.55
3        10207  59265.14
4        10165  67392.85

In [12]:
# Теперь нужно узнать дату, когда были сделаны эти заказы, и статусы, в которых они находятся.

sql_query3 = ('''
SELECT o.orderNumber, o.orderDate, o.status, SUM(od.quantityOrdered * od.priceEach) AS total
FROM orderdetails AS od
INNER JOIN orders AS o 
ON od.orderNumber = o.orderNumber
GROUP BY o.orderNumber
HAVING total > 59000
ORDER BY total DESC;
''')

df3 = pd.read_sql_query(sql_query3, con=db_engine)
df3

   orderNumber   orderDate   status     total
0        10165  2003-10-22  Shipped  67392.85
1        10287  2004-08-30  Shipped  61402.00
2        10310  2004-10-16  Shipped  61234.67
3        10212  2004-01-16  Shipped  59830.55
4        10207  2003-12-09  Shipped  59265.14

In [13]:
# Запрос, который показывает, кто и откуда сделал самые большие заказы.

sql_query4 = ('''
SELECT c.contactFirstName, c.contactLastName, c.country, o.orderNumber, o.orderDate, o.status, SUM(od.quantityOrdered * od.priceEach) AS total
FROM orderdetails AS od
INNER JOIN orders AS o 
ON od.orderNumber = o.orderNumber
INNER JOIN customers AS c 
ON o.customerNumber = c.customerNumber
GROUP BY o.orderNumber
HAVING total > 59000
ORDER BY total DESC;
''')

df4 = pd.read_sql_query(sql_query4, con=db_engine)
df4

,contactFirstName,contactLastName,country,orderNumber,orderDate,status,total
0,Eric,Natividad,Singapore,10165,2003-10-22,Shipped,67392.85
1,Mihael,Holz,Switzerland,10287,2004-08-30,Shipped,61402.00
2,Henriette,Pfalzheim,Germany,10310,2004-10-16,Shipped,61234.67
3,Diego,Freyre,Spain,10212,2004-01-16,Shipped,59830.55
4,Valarie,Franco,USA,10207,2003-12-09,Shipped,59265.14

In [14]:
# Десять моделей продуктов, которые принесли максимальную выручку за всю историю наблюдений.

sql_query5 = ('''
SELECT p.productName, SUM(od.quantityOrdered * od.priceEach) AS total
FROM orderdetails AS od
INNER JOIN products AS p 
ON od.productCode = p.productCode
GROUP BY p.productName
ORDER BY total DESC
LIMIT 10;
''')

df5 = pd.read_sql_query(sql_query5, con=db_engine)
df5

                            productName      total
0           1992 Ferrari 360 Spider red  276839.98
1                     2001 Ferrari Enzo  190755.86
2              1952 Alpine Renault 1300  190017.96
3  2003 Harley-Davidson Eagle Drag Bike  170686.00
4                     1968 Ford Mustang  161531.48
5                      1969 Ford Falcon  152543.02
6           1980s Black Hawk Helicopter  144959.91
7        1998 Chrysler Plymouth Prowler  142530.63
8              1917 Grand Touring Sedan  140535.60
9                      2002 Suzuki XREO  135767.03

In [15]:
# Запрос, который реализует FULL JOIN для таблиц employees и customers,
# и выводит имена и фамилии сотрудников (firstName и lastName) и клиентов (contactFirstName и contactLastName).

sql_query6 = ('''
SELECT e.firstName, e.lastName, c.contactFirstName, c.contactLastName
FROM employees AS e
LEFT JOIN customers AS c 
ON e.employeeNumber = c.salesRepEmployeeNumber
UNION
SELECT e.firstName, e.lastName, c.contactFirstName, c.contactLastName
FROM employees AS e
RIGHT JOIN customers AS c 
ON e.employeeNumber = c.salesRepEmployeeNumber
WHERE e.employeeNumber IS NULL;
''')

df6 = pd.read_sql_query(sql_query6, con=db_engine)
df6

    firstName   lastName contactFirstName contactLastName
0       Diane     Murphy             None            None
1        Mary  Patterson             None            None
2        Jeff   Firrelli             None            None
3     William  Patterson             None            None
4      Gerard     Bondur             None            None
..        ...        ...              ...             ...
125      None       None            Sven          Ottlieb
126      None       None           Carmen           Anton
127      None       None           Hanna             Moos
128      None       None       Alexander          Semenov
129      None       None           Raanan     Altagar,G M

[130 rows x 4 columns]

In [16]:
# Запрос, который возвращает таблицу со столбцами:
# firstName и lastName — имя и фамилия сотрудника; 
# jobTitle — название должности сотрудника; 
# subFirstName и subLastName — имя и фамилия непосредственного подчинённого. 
# если у сотрудника несколько подчинённых, в таблице для него будет несколько строк;
# если у сотрудника нет подчинённых, то поля subFirstName и subLastName должны содержать значения None.

sql_query7 = ('''
SELECT e.firstName, e.lastName, e.jobTitle, sub.firstName AS subFirstName, sub.lastName AS subLastName
FROM employees AS e
LEFT JOIN employees AS sub 
ON e.employeeNumber = sub.reportsTo
ORDER BY e.employeeNumber;
''')

df7 = pd.read_sql_query(sql_query7, con=db_engine)
df7

   firstName   lastName              jobTitle subFirstName subLastName
0      Diane     Murphy             President         Mary   Patterson
1      Diane     Murphy             President         Jeff    Firrelli
2       Mary  Patterson              VP Sales      William   Patterson
3       Mary  Patterson              VP Sales       Gerard      Bondur
4       Mary  Patterson              VP Sales      Anthony         Bow
5       Mary  Patterson              VP Sales         Mami       Nishi
6       Jeff   Firrelli          VP Marketing         None        None
7    William  Patterson  Sales Manager (APAC)         Andy      Fixter
8    William  Patterson  Sales Manager (APAC)        Peter       Marsh
9    William  Patterson  Sales Manager (APAC)          Tom        King
10    Gerard     Bondur   Sale Manager (EMEA)         Loui      Bondur
11    Gerard     Bondur   Sale Manager (EMEA)       Gerard   Hernandez
12    Gerard     Bondur   Sale Manager (EMEA)       Pamela    Castillo
13    Gerard     Bondur   Sale Manager (EMEA)        Larry        Bott
14    Gerard     Bondur   Sale Manager (EMEA)        Barry       Jones
15    Gerard     Bondur   Sale Manager (EMEA)       Martin      Gerard
16   Anthony        Bow    Sales Manager (NA)       Leslie    Jennings
17   Anthony        Bow    Sales Manager (NA)       Leslie    Thompson
18   Anthony        Bow    Sales Manager (NA)        Julie    Firrelli
19   Anthony        Bow    Sales Manager (NA)        Steve   Patterson
20   Anthony        Bow    Sales Manager (NA)     Foon Yue       Tseng
21   Anthony        Bow    Sales Manager (NA)       George      Vanauf
22    Leslie   Jennings             Sales Rep         None        None
23    Leslie   Thompson             Sales Rep         None        None
24     Julie   Firrelli             Sales Rep         None        None
25     Steve  Patterson             Sales Rep         None        None
26  Foon Yue      Tseng             Sales Rep         None        None
27    George     Vanauf             Sales Rep         None        None
28      Loui     Bondur             Sales Rep         None        None
29    Gerard  Hernandez             Sales Rep         None        None
30    Pamela   Castillo             Sales Rep         None        None
31     Larry       Bott             Sales Rep         None        None
32     Barry      Jones             Sales Rep         None        None
33      Andy     Fixter             Sales Rep         None        None
34     Peter      Marsh             Sales Rep         None        None
35       Tom       King             Sales Rep         None        None
36      Mami      Nishi             Sales Rep      Yoshimi        Kato
37   Yoshimi       Kato             Sales Rep         None        None
38    Martin     Gerard             Sales Rep         None        None